coocox/Mplib/Toshaba/TPMP341/cmsis_lib/lib/src/tmpm341_cg.c
    return stby_mode;
}

/**
  * @brief  Set pin status in stop1 mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   ENABLE or DISABLE
  * @retval None
  */
void CG_SetPinStateInStop1Mode(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_STBYCR_DRVE = 1U;
    } else {
        TSB_CG_STBYCR_DRVE = 0U;
    }
}

/**
  * @brief  Get pin status in stop1 mode
  * @param  None
  * @retval State of pin in stop mode
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetPinStateInStop1Mode(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_STBYCR_DRVE == 1U) {
        /* Pin status in stop mode is active */
        state = ENABLE;
    } else {
        /* Do nothing */
    }
    return state;
}

/**
  * @brief  Enables or disables to keep IO control signal in stop2 mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   ENABLE or DISABLE
  * @retval None
  */
void CG_SetPortKeepInStop2Mode(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_STBYCR_PTKEEP = 1U;
    } else {
        TSB_CG_STBYCR_PTKEEP = 0U;
    }
}

/**
  * @brief  Get the status of  IO control signal in stop2 mode
  * @param  None
  * @retval State of IO control signal in stop2 mode
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetPortKeepInStop2Mode(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_STBYCR_PTKEEP == 1U) {
        /* Pin status in stop mode is active */
        state = ENABLE;
    } else {
        /* Do nothing */
    }
    return state;
}

/**
  * @brief  Set the source of fc
  * @param  Source:  The source of fc
  *   This parameter can be one of the following values:
  *   CG_FC_SRC_FOSC or CG_FC_SRC_QUARTER_FPLL
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetFcSrc(CG_FcSrc Source)
{
    Result retval = ERROR;
    FunctionalState fosc_on = DISABLE;
    FunctionalState pllon = DISABLE;
    CG_FoscSrc fosc_src = CG_FOSC_OSC_EXT;

    /* Check the parameters */
    assert_param(IS_CG_FC_SRC(Source));

    if (Source == CG_FC_SRC_FOSC) {
        fosc_src = CG_GetFoscSrc();
        switch (fosc_src) {
        case CG_FOSC_OSC_EXT:
            fosc_on = CG_GetFoscState(CG_FOSC_OSC_EXT);
            if (fosc_on == ENABLE) {
                TSB_CG_PLLSEL_PLLSEL = 0U;
                retval = SUCCESS;
            } else {
                /* Do nothing */
            }
            break;
        case CG_FOSC_OSC_INT:
            fosc_on = CG_GetFoscState(CG_FOSC_OSC_INT);
            if (fosc_on == ENABLE) {
                TSB_CG_PLLSEL_PLLSEL = 0U;
                retval = SUCCESS;
            } else {
                /* Do nothing */
            }
            break;
        case CG_FOSC_CLKIN_EXT:
            TSB_CG_PLLSEL_PLLSEL = 0U;
            retval = SUCCESS;
            break;
        default:
            /* Do nothing */
            break;
        }

    } else {
        pllon = CG_GetPLLState();
        if (pllon == ENABLE) {
            TSB_CG_PLLSEL_PLLSEL = 1U;
            retval = SUCCESS;
        } else {
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Get the source of fc
  * @param  None
  * @retval The source of fc
  *   The value returned can be one of the following values:
  *   CG_FC_SRC_FOSC or CG_FC_SRC_QUARTER_FPLL
  */
CG_FcSrc CG_GetFcSrc(void)
{
    CG_FcSrc fcsrc = CG_FC_SRC_FOSC;

    if (TSB_CG_PLLSEL_PLLSEL == 1U) {
        fcsrc = CG_FC_SRC_QUARTER_FPLL;
    } else {
        /* Do nothing */
    }

    return fcsrc;
}

/**
  * @brief  Set the source of high-resolution PPG clock (ftmrd)
  * @param  FtmrdSrc: Select clock source for ftmrd
  *   This parameter can be one of the following values:
  *   CG_FTMRD_SRC_FPLL , CG_FTMRD_SRC_HALF_FPLL  or
  *   CG_FTMRD_SRC_QUARTER_FPLL 
  * @retval None
  */
void CG_SetFtmrdSrc(CG_FtmrdSrc FtmrdSrc)
{
    uint32_t pwmgear = ~CG_FTMRD_GEAR_MASK;
    uint32_t regval = TSB_CG->PWMGEAR;

    /* Check the parameters */
    assert_param(IS_CG_FTMRD_SRC(FtmrdSrc));

    /* Set the value of fgear */
    switch (FtmrdSrc) {
    case CG_FTMRD_SRC_FPLL:
        pwmgear = FTMRD_GEAR_1_1;
        break;
    case CG_FTMRD_SRC_HALF_FPLL:
        pwmgear = FTMRD_GEAR_1_2;
        break;
    case CG_FTMRD_SRC_QUARTER_FPLL:
        pwmgear = FTMRD_GEAR_1_4;
        break;
    default:
        /* Do nothing */
        break;
    }

    regval &= CG_FTMRD_GEAR_MASK;
    regval |= pwmgear;
    TSB_CG->PWMGEAR = regval;
}

/**
  * @brief  Get the source of high-resolution PPG clock (ftmrd)
  * @param  None
  * @retval Source of ftmrd
  *   The value returned can be one of the following values:
  *   CG_FTMRD_SRC_FPLL , CG_FTMRD_SRC_HALF_FPLL 
  *   CG_FTMRD_SRC_QUARTER_FPLL or  CG_FTMRD_SRC_UNKNOWN
  */
CG_FtmrdSrc CG_GetFtmrdSrc(void)
{
    CG_FtmrdSrc source = CG_FTMRD_SRC_UNKNOWN;
    uint32_t pwmgear = TSB_CG->PWMGEAR;
    pwmgear &= (~CG_FTMRD_GEAR_MASK);

    switch (pwmgear) {
    case FTMRD_GEAR_1_1:
        source = CG_FTMRD_SRC_FPLL;
        break;
    case FTMRD_GEAR_1_2:
        source = CG_FTMRD_SRC_HALF_FPLL;
        break;
    case FTMRD_GEAR_1_4:
        source = CG_FTMRD_SRC_QUARTER_FPLL;
        break;
    default:
        /* Do nothing */
        break;
    }

    return source;
}

/**
  * @brief  Enable or disable to provide TMRD clock
  * @param  NewState: New state of PLL
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetTMRDClk(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_PWMGEAR_TMRDCLKEN = 1U;
    } else {
        TSB_CG_PWMGEAR_TMRDCLKEN = 0U;
    }
}

/**
  * @brief  Get the state of TMRD clock
  * @param  None
  * @retval state of TMRD clock
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE
  */
FunctionalState CG_GetTMRDClkState(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_PWMGEAR_TMRDCLKEN == 1U) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Enable or disable to protect CG registers
  * @param  NewState: New state of PLL
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetProtectCtrl(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG->PROTECT = CG_PROTECT_SET;
    } else {
        TSB_CG->PROTECT = CG_PROTECT_CLEAR;
    }
}

/**
  * @brief  Setup the INT source for releasing low power mode.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_3,
  *   CG_INT_SRC_4, CG_INT_SRC_5, CG_INT_SRC_6, CG_INT_SRC_7,
  *   CG_INT_SRC_PHT_00, CG_INT_SRC_PHT_01,
  *   CG_INT_SRC_PHT_10, CG_INT_SRC_PHT_11,
  *   CG_INT_SRC_PHT_20, CG_INT_SRC_PHT_21,
  *   CG_INT_SRC_PHT_30, CG_INT_SRC_PHT_31,
  *   CG_INT_SRC_PHEVRY_0, CG_INT_SRC_PHEVRY_1,
  *   CG_INT_SRC_PHEVRY_2, CG_INT_SRC_PHEVRY_3,
  *   CG_INT_SRC_8, CG_INT_SRC_9, CG_INT_SRC_A, CG_INT_SRC_B
  * @param  ActiveState: select the active state for release trigger
  *   For INTPHT00 to INTPHT31 and INTPHEVRY0 to INTPHEVRY0, 
  *   only CG_INT_ACTIVE_STATE_RISING can be set.
  *   For INT0 to INTB, one of the following values can be set.
  *   CG_INT_ACTIVE_STATE_L, 
  *   CG_INT_ACTIVE_STATE_H, 
  *   CG_INT_ACTIVE_STATE_FALLING, 
  *   CG_INT_ACTIVE_STATE_RISING or 
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES.
  * @param  NewState: Enable or disable this release trigger
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetSTBYReleaseINTSrc(CG_INTSrc INTSource,
                             CG_INTActiveState ActiveState, FunctionalState NewState)
{
    uint32_t num = 0U;
    uint8_t i = 0U;
    uint8_t j = 0U;
    CG_Byte4 regval[6] = { {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));
    assert_param(IS_CG_INT_ACTIVE_STATE(ActiveState));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);

    switch (i) {
    case 0U:                   /* IMCGA */
        regval[0].byte4 = TSB_CG->IMCGA;
        regval[0].byte[j] &= 0x8CU;
        regval[0].byte[j] |= ActiveState;
        TSB_CG->IMCGA = regval[0].byte4;
        regval[0].byte[j] |= NewState;
        TSB_CG->IMCGA = regval[0].byte4;
        break;

    case 1U:                   /* IMCGB */
        regval[1].byte4 = TSB_CG->IMCGB;
        regval[1].byte[j] &= 0x8CU;
        regval[1].byte[j] |= ActiveState;
        TSB_CG->IMCGB = regval[1].byte4;
        regval[1].byte[j] |= NewState;
        TSB_CG->IMCGB = regval[1].byte4;
        break;

    case 2U:                   /* IMCGC */
        regval[2].byte4 = TSB_CG->IMCGC;
        regval[2].byte[j] &= 0x8CU;

        ActiveState = CG_INT_ACTIVE_STATE_RISING;
        regval[2].byte[j] |= ActiveState;
        TSB_CG->IMCGC = regval[2].byte4;
        regval[2].byte[j] |= NewState;
        TSB_CG->IMCGC = regval[2].byte4;
        break;

